{"pages":[{"title":"Ginger &amp; Ginger Man Mobile Puzzle Game","text":"Ginger &amp; Ginger Man起源這個遊戲的起源是因為與朋友組團去參加曉數碼黑客松兩天一夜所寫出的遊戲，雖然黑客松沒有得名，但是我們仍然在黑客松結束後，又花了半年去增進與改善這款遊戲。 動機黑客松的題目是Puzzle x Mobile，當下與團隊一起想到的是類似下樓梯的玩法，但是樓梯則是用不同的顏色方塊來呈現。藉由方塊與人物之間的互動，去做出一款緊張刺激但是容易上手的手機遊戲。 遊戲說明整個遊戲的核心故事是我們要幫助遊戲中的人物薑餅人逃離吃薑餅的怪獸。薑餅人身上會被賦予有顏色光環，光環的顏色包含：紅色、藍色、綠色、橘色和黃色，總共五種顏色，底下則是由不同的顏色光環所組成的方塊。薑餅人會自動左由移動搜尋與自己光環顏色相同的方塊，當光環的顏色與底下方塊的顏色相同時，薑餅人會往下掉落一個方塊，便可逃避被怪獸吃掉的命運。在薑餅人逃脫的過程，怪獸會一往下追著薑餅人，所以玩家需要操控方塊，讓薑餅人可以一直往下逃跑，若薑餅人被怪獸吃掉的話，則結束遊戲。 操作說明玩家在手機上使用觸控的方式。交換的方式是選擇兩個方塊即可互相交換，被選取到的方塊會有提示。比較進階的功能我們稱作畫筆模式，這個功能可以讓玩家一口氣交換一連串的方塊，操作的方式則是手指按在螢幕上的方塊並且做拖曳的動作後放開，被手指滑動過的方塊則會被選取，接這在想要交換的方塊進行相同的動作(手指在螢幕上滑動）即可以交換 所以交換的方式有兩種 單一交換: 點選兩個不同的方塊 畫筆模式: 多重選曲不同的方塊進行交換 道具說明遊戲中有三種道具可以使用: 改變方塊顏色: 改變底下的任兩種方塊為薑餅人當前的顏色 時間暫停: 時間會暫停，只有薑餅人可以往下逃跑 加速糖果: 在一段時間內，增加薑餅人的逃跑速度 心得雖然這款遊戲是皆由參加黑客松後繼續進行改良，期待完成後可以上架，但是因為大家碩班的事情開始越來越忙了，所以最後就暫停繼續開發的計畫。但是我給自己的期許是往後有時間的時候會再將此作品繼續改良到可以上架的程度。這過程雖然大家白天都要忙實驗室的事情，但是晚上還願意播一點時間一點一滴去完成我們團隊的目標，真的很令人開心與感動，希望往後還有機會可以與其他團隊成員一起合作。 這一個作品是我遊戲生涯的處女作，在做這款遊戲的過程，其實有很多的想法與改進，都需要靠團隊的幫忙。因為我個人覺得團隊才能成就大事，如果自己一個人一定做不成。在這過程也體會到做遊戲的困難，自己的程式能力還有很大的進步空間。","link":"/Hideen/GingerAndGingerMan.html"},{"title":"InstanBang - Two Player Mobile Game","text":"InstanBang - Two Player Mobile Game起源由於個人未來的志向是製作一款遊戲，剛好看到清大有開這門課，便燃起加選的慾望，即使不是清大的學生，但為了體驗開發遊戲的樂趣，就算要通勤上到清大上課也在所不息。所以這款遊戲就是我學了一學期的Unity C#後的成果。 動機由於個人覺得可以與朋友一起玩遊戲是件很享受的事，再加上現在智慧型手機人生一台且手機方便性極高，因此與組員討論後，決定期末做一款手機連線的遊戲。最後經過團隊討論，認為做一款半回合的射擊遊戲還滿有趣的，因為半回合制可以促使玩家去思考每回合該選擇什麼行動，例如射擊、使用技能或防禦等等之類，組合出對當下戰況最佳的策略，而非即時制較為單純的思考。 遊戲特色 半回合制：結合能量條，促使玩家思考出最佳的行動組合 射擊：提示彈道，即使不是專業的射手，也能體會出當射手的樂趣! 單手操作：仿寶可夢的單手操作，在任何地方都可以單手享受遊戲! 地形高低起伏：藉由地形，可以進行遮蔽或是躲藏在高點進行砲擊! 戰爭配樂：讓玩家可以陷入在戰爭的緊張氛圍中 遊戲玩法遊戲開始的過程，場上會有三個砲兵，玩家扮演砲兵指揮官，可以對三個砲兵各自下達不同的指令，想辦法將敵方的砲兵炸死則取得勝利。 勝利條件: 炸死某一方的三個砲兵 操作方式：使用觸控螢幕進行點選或是拖曳 能量系統 砲兵底下會有個能量條，能量條則代表砲兵可以選擇的行動如攻擊、移動或是使用技能。其餘閒置的時候，能量條會自己恢復。每次行動都會損耗能量條，能量條不足時，則無法做對應的行動。例如能量條未滿，便無法發射砲彈(攻擊)。 攻擊的方式 玩家點選砲兵後，砲兵頭上會出現四方形的方塊表示當下所選取的砲兵，在手機的螢幕上進行拖曳的過程，則會出現發射的彈道，依照拖曳的長短，彈道的長度會跟著有所變化，彈道的長短則表示發射的力道，越長則表示射程會越遠，反之。 移動的方式 玩家點選砲兵出現頭上方塊提示後，在螢幕中的地圖點選任何地方，則會自動移動到點選的位置，但是在移動過程則會損耗能量。 技能的方式 玩家點選砲兵後，則砲兵右邊則會出現技能的選單，技能的種類如下 防護罩： 可以防止受到砲彈的攻擊 巨彈： 爆炸範圍更廣，傷害更大的砲彈 醫護彈： 可以對我方的砲兵進行補血 其餘遊戲的整個遊玩過程可以參考Youtube的介紹 (由於錄製這段影片的時候，技能還未完成) 個人心得這是個人第二次作比較完整的遊戲，這款遊戲基本上是我跟另外一個同學一起完成的成果雖然兩個人能力真的有限，但是過程中還是滿享受無數個夜晚在就為了做好這款遊戲，甚至因為人力不足的關係，我還拜託我同學幫忙做一小部分遊戲的功能，真的很感謝我同學與另外一位組員。因為自己是外校，所以起初真的很難找到願意同組的組員，所以真的很感謝他。這款遊戲對我來說，除了完成遊戲的功能，另外比較困難的挑戰是遊戲整體的架構與遊戲運行的流程，可能是自己想要寫出一個比較好的遊戲架構，這樣其他成員在開發的時候，只要專心負責遊戲的功能，便不需要考慮到其他問題。不過這部分真的還需要再磨練磨練，請在期待我下一款遊戲。 謝謝大家觀看 !","link":"/Hideen/InstanBang-Two-player-mobile-game.html"},{"title":"About","text":"Current大家好，我是 gaga目前正在念資工系研究所二年級，預計今年(2017)六月會畢業，但是應該8月底才會正式從學校離開，因為想要再用最後兩個月以學生的身分在做一些規劃，在當兩個月的學生。 About Me未來想要往遊戲業發展，想要做一款可以拉近人與人之間的關係，創造一款可以藉由遊戲和增進朋友、情人甚至是陌生人彼此間的感情。另外，我也很喜歡團隊合作，團隊合作這種與大家一起奮鬥打敗大魔王的感覺，真的會讓人上癮阿。其中一種團隊合作的運動就是排球，也是我很喜愛的運動，希望可以活到老，打球打到老。 對於樂愛團隊合作的我，因此研究所選的領域便是軟體工程，學習如何與一群人合作開發軟體的工程，學習如何在開發的過程避免會遇到的問題或是該注意的事項，最重要的是，該如何因應不同的合作團隊，去擬定出適合的開發流程，這便是我的專業。","link":"/about/index.html"},{"title":"Projects","text":"","link":"/Projects/index.html"}],"posts":[],"tags":[],"categories":[]}